### Tf code used to replicate the issue
<details>
  <summary>Click to expand!</summary>
  
  ```terraform
# az feature register --namespace Microsoft.Network --name BypassCnameCheckForCustomDomainDeletion --subscription "<redacted>" # whoever created this feature deserves a beer
terraform {
  required_version = "~> 0.14.4"
  required_providers { azurerm = "=2.56.0" }
}
provider "azurerm" {
  subscription_id = "<redacted>"
  tenant_id       = "<redacted>"
  features {}
}
locals {
  environment      = "dev001" #
  default_location = "uksouth"
  prefix           = "acctest-FD-001-${local.environment}" # replace 001 to make unique
  storage_prefix   = lower(replace(local.prefix, "-", ""))
  tags             = {}
  fd_settings = {
    default_frontend         = local.prefix
    custom_frontend          = "${local.prefix}-custom"
    custom_frontend_domain   = "jaydoubleu.co.uk"
    default_hp_settings_name = "exampleHealthProbeSetting1"
    default_lb_settings_name = "exampleLoadBalancingSettings1"
  }
}

###############
resource "azurerm_resource_group" "default" {
  name     = "rg-${lower(local.prefix)}"
  location = local.default_location
  tags     = local.tags
}
### storage accounts
resource "azurerm_storage_account" "site01" {
  name                     = "${local.storage_prefix}site01"
  resource_group_name      = azurerm_resource_group.default.name
  location                 = azurerm_resource_group.default.location
  account_tier             = "Standard"
  account_replication_type = "LRS"
  tags                     = local.tags
  static_website {
    error_404_document = "error.html"
    index_document     = "index.html"
  }
}
resource "azurerm_storage_account" "site02" {
  name                     = "${local.storage_prefix}site02"
  resource_group_name      = azurerm_resource_group.default.name
  location                 = azurerm_resource_group.default.location
  account_tier             = "Standard"
  account_replication_type = "LRS"
  tags                     = local.tags
  static_website {
    error_404_document = "error.html"
    index_document     = "index.html"
  }
}
resource "azurerm_storage_account" "site03" {
  name                     = "${local.storage_prefix}site03"
  resource_group_name      = azurerm_resource_group.default.name
  location                 = azurerm_resource_group.default.location
  account_tier             = "Standard"
  account_replication_type = "LRS"
  tags                     = local.tags
  static_website {
    error_404_document = "error.html"
    index_document     = "index.html"
  }
}

resource "azurerm_frontdoor" "default" {
  name                                         = local.prefix
  resource_group_name                          = azurerm_resource_group.default.name
  enforce_backend_pools_certificate_name_check = true
  tags                                         = local.tags
  frontend_endpoint {
    name      = local.fd_settings.default_frontend
    host_name = "${lower(local.fd_settings.default_frontend)}.azurefd.net"
  }
  frontend_endpoint {
    name      = local.fd_settings.custom_frontend
    host_name = "${lower(local.fd_settings.custom_frontend)}.${local.fd_settings.custom_frontend_domain}"
  }
  backend_pool_health_probe {
    name                = local.fd_settings.default_hp_settings_name
    interval_in_seconds = "30"
    protocol            = "Https"
  }
  backend_pool_load_balancing {
    name = local.fd_settings.default_lb_settings_name
  }
  ### site01
  backend_pool {
    name = azurerm_storage_account.site01.name
    backend {
      host_header = azurerm_storage_account.site01.primary_web_host
      address     = azurerm_storage_account.site01.primary_web_host
      http_port   = 80
      https_port  = 443
    }
    load_balancing_name = local.fd_settings.default_lb_settings_name
    health_probe_name   = local.fd_settings.default_hp_settings_name
  }
  routing_rule {
    name               = azurerm_storage_account.site01.name
    enabled            = true
    accepted_protocols = ["Https"]
    patterns_to_match  = ["/*"]
    frontend_endpoints = [local.fd_settings.default_frontend, local.fd_settings.custom_frontend]
    forwarding_configuration {
      forwarding_protocol    = "HttpsOnly"
      backend_pool_name      = azurerm_storage_account.site01.name
      custom_forwarding_path = "/"
    }
  }
  routing_rule {
    name               = "${azurerm_storage_account.site01.name}RedirectHTTPtoHTTPS"
    enabled            = true
    accepted_protocols = ["Http"]
    frontend_endpoints = [local.fd_settings.default_frontend, local.fd_settings.custom_frontend]
    patterns_to_match  = ["/*"]
    redirect_configuration {
      redirect_protocol = "HttpsOnly"
      redirect_type     = "Found"
      custom_path       = "/"
    }
  }

  ### site02
  backend_pool {
    name = azurerm_storage_account.site02.name
    backend {
      host_header = azurerm_storage_account.site02.primary_web_host
      address     = azurerm_storage_account.site02.primary_web_host
      http_port   = 80
      https_port  = 443
    }
    load_balancing_name = local.fd_settings.default_lb_settings_name
    health_probe_name   = local.fd_settings.default_hp_settings_name
  }
  routing_rule {
    name               = azurerm_storage_account.site02.name
    enabled            = true
    accepted_protocols = ["Https"]
    patterns_to_match  = ["/site02", "/site02/*"]
    frontend_endpoints = [local.fd_settings.default_frontend, local.fd_settings.custom_frontend]
    forwarding_configuration {
      forwarding_protocol    = "HttpsOnly"
      backend_pool_name      = azurerm_storage_account.site02.name
      custom_forwarding_path = "/"
    }
  }
  routing_rule {
    name               = "${azurerm_storage_account.site02.name}RedirectHTTPtoHTTPS"
    enabled            = true
    accepted_protocols = ["Http"]
    frontend_endpoints = [local.fd_settings.default_frontend, local.fd_settings.custom_frontend]
    patterns_to_match  = ["/site02", "/site02/*"]
    redirect_configuration {
      redirect_protocol = "HttpsOnly"
      redirect_type     = "Found"
      custom_path       = "/site02/"
    }
  }
  ### site03
  backend_pool {
    name = azurerm_storage_account.site03.name
    backend {
      host_header = azurerm_storage_account.site03.primary_web_host
      address     = azurerm_storage_account.site03.primary_web_host
      http_port   = 80
      https_port  = 443
    }
    load_balancing_name = local.fd_settings.default_lb_settings_name
    health_probe_name   = local.fd_settings.default_hp_settings_name
  }
  routing_rule {
    name               = azurerm_storage_account.site03.name
    enabled            = true
    accepted_protocols = ["Https"]
    patterns_to_match  = ["/site03", "/site03/*"]
    frontend_endpoints = [local.fd_settings.default_frontend, local.fd_settings.custom_frontend]
    forwarding_configuration {
      forwarding_protocol    = "HttpsOnly"
      backend_pool_name      = azurerm_storage_account.site03.name
      custom_forwarding_path = "/"
    }
  }
  routing_rule {
    name               = "${azurerm_storage_account.site03.name}RedirectHTTPtoHTTPS"
    enabled            = true
    accepted_protocols = ["Http"]
    frontend_endpoints = [local.fd_settings.default_frontend, local.fd_settings.custom_frontend]
    patterns_to_match  = ["/site03", "/site03/*"]
    redirect_configuration {
      redirect_protocol = "HttpsOnly"
      redirect_type     = "Found"
      custom_path       = "/site03/"
    }
  }
}
  ```
</details>

### First terraform apply
<details>
  <summary>Click to expand!</summary>
  
  ```terraform
Warning: Provider development overrides are in effect

The following provider development overrides are set in the CLI configuration:
 - hashicorp/azurerm in /home/jaydoubleu/devel/providers/devel/terraform-provider-azurerm_bins/11456

The behavior may therefore not match any released version of the provider and
applying changes may cause the state to become incompatible with published
releases.

azurerm_resource_group.default: Refreshing state... [id=/subscriptions/<redacted>/resourceGroups/rg-acctest-fd-001-dev001]
azurerm_storage_account.site01: Refreshing state... [id=/subscriptions/<redacted>/resourceGroups/rg-acctest-fd-001-dev001/providers/Microsoft.Storage/storageAccounts/acctestfd001dev001site01]
azurerm_storage_account.site02: Refreshing state... [id=/subscriptions/<redacted>/resourceGroups/rg-acctest-fd-001-dev001/providers/Microsoft.Storage/storageAccounts/acctestfd001dev001site02]
azurerm_storage_account.site03: Refreshing state... [id=/subscriptions/<redacted>/resourceGroups/rg-acctest-fd-001-dev001/providers/Microsoft.Storage/storageAccounts/acctestfd001dev001site03]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_frontdoor.default will be created
  + resource "azurerm_frontdoor" "default" {
      + backend_pool_health_probes                   = (known after apply)
      + backend_pool_load_balancing_settings         = (known after apply)
      + backend_pools                                = (known after apply)
      + backend_pools_send_receive_timeout_seconds   = 60
      + cname                                        = (known after apply)
      + enforce_backend_pools_certificate_name_check = true
      + frontend_endpoints                           = (known after apply)
      + header_frontdoor_id                          = (known after apply)
      + id                                           = (known after apply)
      + load_balancer_enabled                        = true
      + location                                     = (known after apply)
      + name                                         = "acctest-FD-001-dev001"
      + resource_group_name                          = "rg-acctest-fd-001-dev001"
      + routing_rules                                = (known after apply)

      + backend_pool {
          + health_probe_name   = "exampleHealthProbeSetting1"
          + id                  = (known after apply)
          + load_balancing_name = "exampleLoadBalancingSettings1"
          + name                = "acctestfd001dev001site01"

          + backend {
              + address     = "acctestfd001dev001site01.z33.web.core.windows.net"
              + enabled     = true
              + host_header = "acctestfd001dev001site01.z33.web.core.windows.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "exampleHealthProbeSetting1"
          + id                  = (known after apply)
          + load_balancing_name = "exampleLoadBalancingSettings1"
          + name                = "acctestfd001dev001site02"

          + backend {
              + address     = "acctestfd001dev001site02.z33.web.core.windows.net"
              + enabled     = true
              + host_header = "acctestfd001dev001site02.z33.web.core.windows.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "exampleHealthProbeSetting1"
          + id                  = (known after apply)
          + load_balancing_name = "exampleLoadBalancingSettings1"
          + name                = "acctestfd001dev001site03"

          + backend {
              + address     = "acctestfd001dev001site03.z33.web.core.windows.net"
              + enabled     = true
              + host_header = "acctestfd001dev001site03.z33.web.core.windows.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }

      + backend_pool_health_probe {
          + enabled             = true
          + id                  = (known after apply)
          + interval_in_seconds = 30
          + name                = "exampleHealthProbeSetting1"
          + path                = "/"
          + probe_method        = "GET"
          + protocol            = "Https"
        }

      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + id                              = (known after apply)
          + name                            = "exampleLoadBalancingSettings1"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }

      + frontend_endpoint {
          + custom_https_provisioning_enabled = (known after apply)
          + host_name                         = "acctest-fd-001-dev001.azurefd.net"
          + id                                = (known after apply)
          + name                              = "acctest-FD-001-dev001"
          + session_affinity_enabled          = false
          + session_affinity_ttl_seconds      = 0

          + custom_https_configuration {
              + azure_key_vault_certificate_secret_name    = (known after apply)
              + azure_key_vault_certificate_secret_version = (known after apply)
              + azure_key_vault_certificate_vault_id       = (known after apply)
              + certificate_source                         = (known after apply)
              + minimum_tls_version                        = (known after apply)
              + provisioning_state                         = (known after apply)
              + provisioning_substate                      = (known after apply)
            }
        }
      + frontend_endpoint {
          + custom_https_provisioning_enabled = (known after apply)
          + host_name                         = "acctest-fd-001-dev001-custom.jaydoubleu.co.uk"
          + id                                = (known after apply)
          + name                              = "acctest-FD-001-dev001-custom"
          + session_affinity_enabled          = false
          + session_affinity_ttl_seconds      = 0

          + custom_https_configuration {
              + azure_key_vault_certificate_secret_name    = (known after apply)
              + azure_key_vault_certificate_secret_version = (known after apply)
              + azure_key_vault_certificate_vault_id       = (known after apply)
              + certificate_source                         = (known after apply)
              + minimum_tls_version                        = (known after apply)
              + provisioning_state                         = (known after apply)
              + provisioning_substate                      = (known after apply)
            }
        }

      + routing_rule {
          + accepted_protocols = [
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "acctest-FD-001-dev001",
              + "acctest-FD-001-dev001-custom",
            ]
          + id                 = (known after apply)
          + name               = "acctestfd001dev001site01"
          + patterns_to_match  = [
              + "/*",
            ]

          + forwarding_configuration {
              + backend_pool_name                     = "acctestfd001dev001site01"
              + cache_enabled                         = false
              + cache_query_parameter_strip_directive = "StripAll"
              + cache_use_dynamic_compression         = false
              + custom_forwarding_path                = "/"
              + forwarding_protocol                   = "HttpsOnly"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "acctest-FD-001-dev001",
              + "acctest-FD-001-dev001-custom",
            ]
          + id                 = (known after apply)
          + name               = "acctestfd001dev001site01RedirectHTTPtoHTTPS"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + custom_path       = "/"
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Found"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "acctest-FD-001-dev001",
              + "acctest-FD-001-dev001-custom",
            ]
          + id                 = (known after apply)
          + name               = "acctestfd001dev001site02"
          + patterns_to_match  = [
              + "/site02",
              + "/site02/*",
            ]

          + forwarding_configuration {
              + backend_pool_name                     = "acctestfd001dev001site02"
              + cache_enabled                         = false
              + cache_query_parameter_strip_directive = "StripAll"
              + cache_use_dynamic_compression         = false
              + custom_forwarding_path                = "/"
              + forwarding_protocol                   = "HttpsOnly"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "acctest-FD-001-dev001",
              + "acctest-FD-001-dev001-custom",
            ]
          + id                 = (known after apply)
          + name               = "acctestfd001dev001site02RedirectHTTPtoHTTPS"
          + patterns_to_match  = [
              + "/site02",
              + "/site02/*",
            ]

          + redirect_configuration {
              + custom_path       = "/site02/"
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Found"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "acctest-FD-001-dev001",
              + "acctest-FD-001-dev001-custom",
            ]
          + id                 = (known after apply)
          + name               = "acctestfd001dev001site03"
          + patterns_to_match  = [
              + "/site03",
              + "/site03/*",
            ]

          + forwarding_configuration {
              + backend_pool_name                     = "acctestfd001dev001site03"
              + cache_enabled                         = false
              + cache_query_parameter_strip_directive = "StripAll"
              + cache_use_dynamic_compression         = false
              + custom_forwarding_path                = "/"
              + forwarding_protocol                   = "HttpsOnly"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "acctest-FD-001-dev001",
              + "acctest-FD-001-dev001-custom",
            ]
          + id                 = (known after apply)
          + name               = "acctestfd001dev001site03RedirectHTTPtoHTTPS"
          + patterns_to_match  = [
              + "/site03",
              + "/site03/*",
            ]

          + redirect_configuration {
              + custom_path       = "/site03/"
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Found"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

azurerm_frontdoor.default: Creating...
azurerm_frontdoor.default: Still creating... [10s elapsed]
azurerm_frontdoor.default: Still creating... [20s elapsed]
azurerm_frontdoor.default: Still creating... [30s elapsed]
azurerm_frontdoor.default: Still creating... [40s elapsed]
azurerm_frontdoor.default: Still creating... [50s elapsed]
azurerm_frontdoor.default: Still creating... [1m0s elapsed]
azurerm_frontdoor.default: Still creating... [1m10s elapsed]
azurerm_frontdoor.default: Still creating... [1m20s elapsed]
azurerm_frontdoor.default: Creation complete after 1m22s [id=/subscriptions/<redacted>/resourceGroups/rg-acctest-fd-001-dev001/providers/Microsoft.Network/frontDoors/acctest-FD-001-dev001]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
  ```
</details>

### Terraform plan output right after first creation replicating sorting issue
<details>
  <summary>Click to expand!</summary>
  
  ```terraform
azurerm_resource_group.default: Refreshing state... [id=/subscriptions/<redacted>/resourceGroups/rg-acctest-fd-001-dev001]
azurerm_storage_account.site03: Refreshing state... [id=/subscriptions/<redacted>/resourceGroups/rg-acctest-fd-001-dev001/providers/Microsoft.Storage/storageAccounts/acctestfd001dev001site03]
azurerm_storage_account.site01: Refreshing state... [id=/subscriptions/<redacted>/resourceGroups/rg-acctest-fd-001-dev001/providers/Microsoft.Storage/storageAccounts/acctestfd001dev001site01]
azurerm_storage_account.site02: Refreshing state... [id=/subscriptions/<redacted>/resourceGroups/rg-acctest-fd-001-dev001/providers/Microsoft.Storage/storageAccounts/acctestfd001dev001site02]
azurerm_frontdoor.default: Refreshing state... [id=/subscriptions/<redacted>/resourceGroups/rg-acctest-fd-001-dev001/providers/Microsoft.Network/frontDoors/acctest-FD-001-dev001]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_frontdoor.default will be updated in-place
  ~ resource "azurerm_frontdoor" "default" {
        id                                           = "/subscriptions/<redacted>/resourceGroups/rg-acctest-fd-001-dev001/providers/Microsoft.Network/frontDoors/acctest-FD-001-dev001"
        name                                         = "acctest-FD-001-dev001"
        tags                                         = {}
        # (12 unchanged attributes hidden)

      ~ backend_pool {
            id                  = "/subscriptions/<redacted>/resourceGroups/rg-acctest-fd-001-dev001/providers/Microsoft.Network/frontDoors/acctest-FD-001-dev001/backendPools/acctestfd001dev001site03"
          ~ name                = "acctestfd001dev001site03" -> "acctestfd001dev001site02"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "acctestfd001dev001site03.z33.web.core.windows.net" -> "acctestfd001dev001site02.z33.web.core.windows.net"
              ~ host_header = "acctestfd001dev001site03.z33.web.core.windows.net" -> "acctestfd001dev001site02.z33.web.core.windows.net"
                # (5 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
            id                  = "/subscriptions/<redacted>/resourceGroups/rg-acctest-fd-001-dev001/providers/Microsoft.Network/frontDoors/acctest-FD-001-dev001/backendPools/acctestfd001dev001site02"
          ~ name                = "acctestfd001dev001site02" -> "acctestfd001dev001site03"
            # (2 unchanged attributes hidden)

          ~ backend {
              ~ address     = "acctestfd001dev001site02.z33.web.core.windows.net" -> "acctestfd001dev001site03.z33.web.core.windows.net"
              ~ host_header = "acctestfd001dev001site02.z33.web.core.windows.net" -> "acctestfd001dev001site03.z33.web.core.windows.net"
                # (5 unchanged attributes hidden)
            }
        }



      ~ frontend_endpoint {
          ~ host_name                         = "acctest-fd-001-dev001-custom.jaydoubleu.co.uk" -> "acctest-fd-001-dev001.azurefd.net"
            id                                = "/subscriptions/<redacted>/resourceGroups/rg-acctest-fd-001-dev001/providers/Microsoft.Network/frontDoors/acctest-FD-001-dev001/frontendEndpoints/acctest-FD-001-dev001-custom"
          ~ name                              = "acctest-FD-001-dev001-custom" -> "acctest-FD-001-dev001"
            # (3 unchanged attributes hidden)
        }
      ~ frontend_endpoint {
          ~ host_name                         = "acctest-fd-001-dev001.azurefd.net" -> "acctest-fd-001-dev001-custom.jaydoubleu.co.uk"
            id                                = "/subscriptions/<redacted>/resourceGroups/rg-acctest-fd-001-dev001/providers/Microsoft.Network/frontDoors/acctest-FD-001-dev001/frontendEndpoints/acctest-FD-001-dev001"
          ~ name                              = "acctest-FD-001-dev001" -> "acctest-FD-001-dev001-custom"
            # (3 unchanged attributes hidden)
        }

      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
            id                 = "/subscriptions/<redacted>/resourceGroups/rg-acctest-fd-001-dev001/providers/Microsoft.Network/frontDoors/acctest-FD-001-dev001/routingRules/acctestfd001dev001site01RedirectHTTPtoHTTPS"
          ~ name               = "acctestfd001dev001site01RedirectHTTPtoHTTPS" -> "acctestfd001dev001site01"
            # (3 unchanged attributes hidden)

          + forwarding_configuration {
              + backend_pool_name                     = "acctestfd001dev001site01"
              + cache_enabled                         = false
              + cache_query_parameter_strip_directive = "StripAll"
              + cache_use_dynamic_compression         = false
              + custom_forwarding_path                = "/"
              + forwarding_protocol                   = "HttpsOnly"
            }

          - redirect_configuration {
              - custom_path       = "/" -> null
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Found" -> null
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Https",
              + "Http",
            ]
            id                 = "/subscriptions/<redacted>/resourceGroups/rg-acctest-fd-001-dev001/providers/Microsoft.Network/frontDoors/acctest-FD-001-dev001/routingRules/acctestfd001dev001site02"
          ~ name               = "acctestfd001dev001site02" -> "acctestfd001dev001site01RedirectHTTPtoHTTPS"
          ~ patterns_to_match  = [
              - "/site02",
              - "/site02/*",
              + "/*",
            ]
            # (2 unchanged attributes hidden)

          - forwarding_configuration {
              - backend_pool_name                     = "acctestfd001dev001site02" -> null
              - cache_enabled                         = false -> null
              - cache_query_parameter_strip_directive = "StripAll" -> null
              - cache_use_dynamic_compression         = false -> null
              - custom_forwarding_path                = "/" -> null
              - forwarding_protocol                   = "HttpsOnly" -> null
            }

          + redirect_configuration {
              + custom_path       = "/"
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Found"
            }
        }
      ~ routing_rule {
            id                 = "/subscriptions/<redacted>/resourceGroups/rg-acctest-fd-001-dev001/providers/Microsoft.Network/frontDoors/acctest-FD-001-dev001/routingRules/acctestfd001dev001site01"
          ~ name               = "acctestfd001dev001site01" -> "acctestfd001dev001site02"
          ~ patterns_to_match  = [
              - "/*",
              + "/site02",
              + "/site02/*",
            ]
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "acctestfd001dev001site01" -> "acctestfd001dev001site02"
                # (5 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
            id                 = "/subscriptions/<redacted>/resourceGroups/rg-acctest-fd-001-dev001/providers/Microsoft.Network/frontDoors/acctest-FD-001-dev001/routingRules/acctestfd001dev001site03RedirectHTTPtoHTTPS"
          ~ name               = "acctestfd001dev001site03RedirectHTTPtoHTTPS" -> "acctestfd001dev001site02RedirectHTTPtoHTTPS"
          ~ patterns_to_match  = [
              - "/site03",
              - "/site03/*",
              + "/site02",
              + "/site02/*",
            ]
            # (3 unchanged attributes hidden)

          ~ redirect_configuration {
              ~ custom_path       = "/site03/" -> "/site02/"
                # (2 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
            id                 = "/subscriptions/<redacted>/resourceGroups/rg-acctest-fd-001-dev001/providers/Microsoft.Network/frontDoors/acctest-FD-001-dev001/routingRules/acctestfd001dev001site02RedirectHTTPtoHTTPS"
          ~ name               = "acctestfd001dev001site02RedirectHTTPtoHTTPS" -> "acctestfd001dev001site03"
          ~ patterns_to_match  = [
              - "/site02",
              - "/site02/*",
              + "/site03",
              + "/site03/*",
            ]
            # (2 unchanged attributes hidden)

          + forwarding_configuration {
              + backend_pool_name                     = "acctestfd001dev001site03"
              + cache_enabled                         = false
              + cache_query_parameter_strip_directive = "StripAll"
              + cache_use_dynamic_compression         = false
              + custom_forwarding_path                = "/"
              + forwarding_protocol                   = "HttpsOnly"
            }

          - redirect_configuration {
              - custom_path       = "/site02/" -> null
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Found" -> null
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Https",
              + "Http",
            ]
            id                 = "/subscriptions/<redacted>/resourceGroups/rg-acctest-fd-001-dev001/providers/Microsoft.Network/frontDoors/acctest-FD-001-dev001/routingRules/acctestfd001dev001site03"
          ~ name               = "acctestfd001dev001site03" -> "acctestfd001dev001site03RedirectHTTPtoHTTPS"
            # (3 unchanged attributes hidden)

          - forwarding_configuration {
              - backend_pool_name                     = "acctestfd001dev001site03" -> null
              - cache_enabled                         = false -> null
              - cache_query_parameter_strip_directive = "StripAll" -> null
              - cache_use_dynamic_compression         = false -> null
              - custom_forwarding_path                = "/" -> null
              - forwarding_protocol                   = "HttpsOnly" -> null
            }

          + redirect_configuration {
              + custom_path       = "/site03/"
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Found"
            }
        }
        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

  ```
</details>

###
Ps. I have temporarily pre-created cnames under my domain for prefix `001..005` (001 already used by me)
Feel free to flip local.prefix between 002 and 005 to replicate issue straight away if you don't have custom domain by hand.


![cname conffig](https://i.ibb.co/kJJPfY7/cnames.png)
![frontdoor 001 conffig](https://i.ibb.co/M8ygK3y/frontdooracctest.png)


